import { AssumptionType } from "./AssumptionType";

/**
 * Именно от настройки весов зависит правильная работа алгоритма решения пузыря.
 * Поэтому веса настраиваются здесь централизованно.
 */
export const assumptionWeights: Record<AssumptionType, number> = {
  // - эти действия мало зависят друг от друга
  MononuclearHydride: 1,
  HydrogenCollapse: 2,
  SingleAtom: 3,

  // - для расшифровки сложных узлов порядок важен
  TemplateGroup: 4, // Поиск и замена по шаблонам выполняется в первую очередь
  ValencyPredictor: 5, // Предположения о валентности делаются после замены шаблонов
  NodeResolver: 6, // алгоритм решения узла не будет работать без внутренних валентностей
  CountExpand: 7, // раскрытие элементов с коэффициентами происходит только если NodeResolver остановился
  Rollback: 8, // откаты происходят в последнюю очередь, если других вариантов больше нет
}